org/testdata/options.org
#+OPTIONS: toc:nil f:nil e:nil

* DONE [#A] =#+OPTIONS:= toggles supported by =go-org=                 :tag1:tag2:
=go-org= supports multiple export toggles as described in the [[https://orgmode.org/manual/Export-settings.html][export settings]] section of the Org mode manual.
By default (most of?) those toggles are enabled. This file starts with =#+OPTIONS: toc:nil f:nil e:nil= and thus
disables the table of contents, footnotes & entities.
That means, entities like =---= --- (mdash) will be left untouched, footnotes like =[fn:1]= [fn:1] will
not be exported and there won't be a table of contents at the top.
As buffer options are merged with the defaults, the above headline will be exported *with* priority, todo status & tags.


| key  | description                                               |
|------+-----------------------------------------------------------|
| f    | Include footnotes (definitions & links)                   |
| e    | Include entities                                          |
| toc  | Include table of contents (outline)                       |
|------+-----------------------------------------------------------|
| pri  | Include priority =[#A]=, =[#B]=, =[#C]= in headline title |
| todo | Include todo status in headline title                     |
| tags | Include tags in headline title                            |

[fn:1] This footnote definition won't be printed
