org/testdata/options.html
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
<span class="todo">DONE</span>
<span class="priority">[A]</span>
<code class="verbatim">#+OPTIONS:</code> toggles supported by <code class="verbatim">go-org</code>&#xa0;&#xa0;&#xa0;<span class="tags"><span>tag1</span>&#xa0;<span>tag2</span></span>
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p><code class="verbatim">go-org</code> supports multiple export toggles as described in the <a href="https://orgmode.org/manual/Export-settings.html">export settings</a> section of the Org mode manual.
By default (most of?) those toggles are enabled. This file starts with <code class="verbatim">#+OPTIONS: toc:nil f:nil e:nil</code> and thus
disables the table of contents, footnotes &amp; entities.
That means, entities like <code class="verbatim">---</code> --- (mdash) will be left untouched, footnotes like <code class="verbatim">[fn:1]</code>  will
not be exported and there won&#39;t be a table of contents at the top.
As buffer options are merged with the defaults, the above headline will be exported <strong>with</strong> priority, todo status &amp; tags.</p>
<table>
<thead>
<tr>
<th>key</th>
<th>description</th>
</tr>
</thead>
<tbody>
<tr>
<td>f</td>
<td>Include footnotes (definitions &amp; links)</td>
</tr>
<tr>
<td>e</td>
<td>Include entities</td>
</tr>
<tr>
<td>toc</td>
<td>Include table of contents (outline)</td>
</tr>
</tbody>
<tbody>
<tr>
<td>pri</td>
<td>Include priority <code class="verbatim">[#A]</code>, <code class="verbatim">[#B]</code>, <code class="verbatim">[#C]</code> in headline title</td>
</tr>
<tr>
<td>todo</td>
<td>Include todo status in headline title</td>
</tr>
<tr>
<td>tags</td>
<td>Include tags in headline title</td>
</tr>
</tbody>
</table>
</div>
</div>
